import random

# اول یه پیام برای شروع بازی نشون میدیم
print("به بازی حدس عدد خوش اومدی!")
print("من یه عدد بین 1 تا 20 انتخاب کردم.")
print("ببینم میتونی حدسش بزنی یا نه.")

# اینجا کامپیوتر یه عدد تصادفی بین 1 تا 20 انتخاب میکنه
secret_number = random.randint(1, 20)

# تعداد تلاش ها رو از صفر شروع میکنیم
attempts = 0

# تا وقتی جواب درست نشده، بازی ادامه داره
while True:

    # از کاربر میخوایم حدس خودش رو وارد کنه
    guess = int(input("حدست رو وارد کن: "))

    # هر بار که حدس میزنه، یکی به تعداد تلاش ها اضافه میشه
    attempts += 1

    # اگر حدس از عدد مخفی کوچکتر باشه
    if guess < secret_number:
        print("اشتباهه! عدد من بزرگ تره.")

    # اگر حدس از عدد مخفی بزرگتر باشه
    elif guess > secret_number:
        print("اشتباهه! عدد من کوچکتره.")

    # اگر هیچکدوم نباشه، یعنی جواب درسته
    else:
        print("آفرین! درست حدس زدی.")
        print(f"تعداد تلاش های تو: {attempts}")

        # جواب درست شده، پس از حلقه خارج میشیم
        break
